# Clear Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalApplicationArray..::..Clear Method
ExternalApplicationArray Class See Also
---
Removes every item from the array, rendering it empty.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Clear()
```

Visual Basic
---
```text
Public Overridable Sub Clear
```

Visual C++
---
```text
public:
virtual void Clear()
```

# See Also
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace